function memGen(){
    function randomWord(){
        let word = ["БЛЯДЬ", "ЕБАТЬ", "ЁБ", "ПИЗДА", "ХУЙ", "БЛЯ!", "БЛЯДИАДА", "БЛЯДИНОС", "БЛЯДИСТОСТЬ", "БЛЯДОГОН", "БЛЯДОСЛОВНИК", "БЛЯДСКИЙ", "БЛЯДСКИЙ", "БЛЯХОМУДИЯ", "ВЗБЛЯД", "ВПИЗДЯЧИЛ", "ВЫБЛЯДОВАЛ", "ВЫБЛЯДОК", "ВЫЕБОН", "ВЫЁБЫВАЕТСЯ", "ГЛУПИЗДИ", "ГОЛОЁБИЦА", "ГРЕБЛЯДЬ", "ДЕРЬМОХЕРОПИЗДОКРАТ", "ДЕРЬМОХЕРОПИЗДОКРАТИЯ", "ДОЕБАЛСЯ", "ЕБАЛО", "ЕБАНЁШЬСЯ", "ЕБАНУЛ", "ЕБАШИТ", "ЁБКОСТЬ", "ЁБНУЛ?", "ЖИДОЁБ", "ЖИДОЁБСКИЙ", "ЗАЕБАЛ", "ЗАЕБИСЬ!", "ЗАЕБЦОВЫЙ", "ЗАЁБ", "ИЗЪЕБНУЛСЯ", "ИСПИЗДЕЛСЯ", "КОЗЛОЁБ", "КОЗЛОЁБИНА", "КОЗЛОЁБИЩЕ", "КОСОЁБИТСЯ", "МНОГОПИЗДНАЯ", "НАБЛЯДОВАЛ", "НАЕБАШИЛСЯ", "НАЕБНУЛСЯ", "ОБЕРБЛЯДЬ", "ОБЪЕБАЛ", "ОБЪЕБАТЕЛЬСТВО", "ОДНОХУЙСТВЕННО", "ОПИЗДОУМЕЛ", "ОСКОТОЁБИЛСЯ", "ОСТОЕБАЛ", "ПЁЗДЫ", "ПИЗДА", "ПИЗДАБОЛ", "ПИЗДАТЫЙ", "ПИЗДЕЛЯКАЕТ", "ПИЗДЕЦ", "ПИЗДЕЦКИЙ", "ПИЗДОБЛОШКА", "ПИЗДОБРАТ", "ПИЗДОБРАТИЯ", "ПИЗДОВЛАДЕЛЕЦ", "ПИЗДОДУШИЕ", "ПИЗДОЁБИЩНОСТЬ", "ПИЗДОМАНИЯ", "ПИЗДОПЛЯСКА", "ПИЗДРИК", "ПОДПИЗДЫВАЕТ", "ПОДЪЁБКА", "ПОДЪЁБКИ", "ПОЕБЕНЬ", "РАСПИЗДОШИЛ", "РАСПИЗДЯЙ", "СКОТОЁБ", "СКОТОЁБИНА", "СОСИХУЙСКИЙ", "СПИЗДИЛ", "СТРАХОЁБИЩЕ", "ТРЕПЕЗДОН", "ТРЕПЕЗДОНИТ", "УЕБАЛСЯ", "УЁБИЩЕ", "УЁБИЩЕНСКИ", "ХИТРОВЫЕБАННЫЙ", "ХУЕДИН", "ХУЕЛЕС", "ХУЕМАН", "ХУЁВО", "ХУЙНЯ", "ХУЙНЯ", "ШАРОЁБИТСЯ", "БЕЗ ПИЗДЫ!", "БЕЗ ПИЗДЫ?!", "БЛЯ БУДУ!", "БЛЯДЕМУДИНЫЙ ПИЗДОПРОЁБ", "ВДРУГ, ОТКУДА НИ ВОЗЬМИСЬ, ПОЯВИЛСЯ В РОТ ЕБИСЬ!", "В ПИЗДУ — В ПИЗДУ!", "ВЫСШИЙ ПИЗДЕЦ!", "ГОЛОВКА ОТ ХУЯ!", "ДА ЕБАЛ Я!", "ЕБАЛЬНИК РАЗИНУЛ (раскрыл, распахнул)", "ЕБАЛЬНЫЙ СТАНОК", "ЕБЁТ В РОТ И В ЖОПУ", "ЁБАНЫЙ СТОС!", "ЁБ (ёп) ТВОЮ МАТЬ!", "ЗАЕБЁШЬ МЁРТВОГО!", "ЗАПРОСТО ХУЙ!", "ЗА ПРОСТО ХУЙ", "КАК ЁБ ТВОЮ МАТЬ!", "КОГДА ТЫ ПИЗДИШЬ, Я ОТДЫХАЮ!", "МАЛОЕБУЩИЙ (малоебучий) ФАКТОР", "НАСТРЕЛЯЛИ (настучали, постучали, надавали, побарабанили) ПО ПИЗДЮЛЯТОРУ", "НЕ ПИЗДЕТЬ БЫЛА КОМАНДА!", "ХУЯМИ ОБЛОЖИЛ", "КЛАССИЧЕСКОЕ СЛОВО ИЗ ТРЁХ БУКВ"];
        word = word[Math.floor(Math.random()*word.length)]
        return word;
    }

    function randomImg(){
        let randomImgNumber = Math.ceil(Math.random()*51)
        let randomImgAdress = "src/memGenRandomImgs/"+randomImgNumber+".jpg"
        return randomImgAdress;
    }

    let upperText = document.getElementById("upperText");
    let bottomText = document.getElementById("bottomText");
    let MemeImg = document.getElementById("MemeImg");

    upperText.innerHTML = randomWord();
    bottomText.innerHTML = randomWord();
    MemeImg.src = randomImg();
    console.log(MemeImg.src)
}
